const productsInfo = [
	{
		productId: 1,
		imgPreviewSrc: "/images/products_previews/product_preview_01.jpg",
		imgFullSrc: "/images/products_full/product_full_01.jpg",
		title: "Устрицы по рокфеллеровски",
		description:
			"Значимость этих проблем настолько очевидна, что укрепление и развитие структуры",
		descriptionDetailed:
			"Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений. Разнообразный и богатый опыт начало повседневной работы по формированию позиции требуют от нас анализа позиций.Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений.",
		price: 2700,
		portion: 500,
	},
	{
		productId: 2,
		imgPreviewSrc: "/images/products_previews/product_preview_02.jpg",
		imgFullSrc: "/images/products_full/product_full_02.jpg",
		title: "Свиные ребрышки на гриле с зеленью",
		description: "Не следует, однако забывать, что реализация намеченных плановых",
		descriptionDetailed:
			"Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений. Разнообразный и богатый опыт начало повседневной работы по формированию позиции требуют от нас анализа позиций.Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений.",
		price: 1600,
		portion: 750,
	},
	{
		productId: 3,
		imgPreviewSrc: "/images/products_previews/product_preview_03.jpg",
		imgFullSrc: "/images/products_full/product_full_03.jpg",
		title: "Креветки по-королевски в лимонном соке",
		description:
			"Значимость этих проблем настолько очевидна, что укрепление и развитие структуры обеспечивает широкому кругу",
		descriptionDetailed:
			"Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений. Разнообразный и богатый опыт начало повседневной работы по формированию позиции требуют от нас анализа позиций.Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений.",
		price: 1820,
		portion: 7,
		units: "шт.",
	},
	{
		productId: 4,
		imgPreviewSrc: "/images/products_previews/product_preview_01.jpg",
		imgFullSrc: "/images/products_full/product_full_01.jpg",
		title: "Устрицы по рокфеллеровски",
		description:
			"Значимость этих проблем настолько очевидна, что укрепление и развитие структуры",
		descriptionDetailed:
			"Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений. Разнообразный и богатый опыт начало повседневной работы по формированию позиции требуют от нас анализа позиций.Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений.",
		price: 2700,
		portion: 500,
	},
	{
		productId: 5,
		imgPreviewSrc: "/images/products_previews/product_preview_01.jpg",
		imgFullSrc: "/images/products_full/product_full_01.jpg",
		title: "Устрицы по рокфеллеровски",
		description:
			"Значимость этих проблем настолько очевидна, что укрепление и развитие структуры",
		descriptionDetailed:
			"Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений. Разнообразный и богатый опыт начало повседневной работы по формированию позиции требуют от нас анализа позиций.Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений.",
		price: 2700,
		portion: 500,
	},
	{
		productId: 6,
		imgPreviewSrc: "/images/products_previews/product_preview_02.jpg",
		imgFullSrc: "/images/products_full/product_full_02.jpg",
		title: "Свиные ребрышки на гриле с зеленью",
		description: "Не следует, однако забывать, что реализация намеченных плановых",
		descriptionDetailed:
			"Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений. Разнообразный и богатый опыт начало повседневной работы по формированию позиции требуют от нас анализа позиций.Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений.",
		price: 1600,
		portion: 750,
	},
	{
		productId: 7,
		imgPreviewSrc: "/images/products_previews/product_preview_03.jpg",
		imgFullSrc: "/images/products_full/product_full_03.jpg",
		title: "Креветки по-королевски в лимонном соке",
		description:
			"Значимость этих проблем настолько очевидна, что укрепление и развитие структуры обеспечивает широкому кругу",
		descriptionDetailed:
			"Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений. Разнообразный и богатый опыт начало повседневной работы по формированию позиции требуют от нас анализа позиций.Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений.",
		price: 1820,
		portion: 7,
		units: "шт.",
	},
	{
		productId: 8,
		imgPreviewSrc: "/images/products_previews/product_preview_01.jpg",
		imgFullSrc: "/images/products_full/product_full_01.jpg",
		title: "Устрицы по рокфеллеровски",
		description:
			"Значимость этих проблем настолько очевидна, что укрепление и развитие структуры",
		descriptionDetailed:
			"Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений. Разнообразный и богатый опыт начало повседневной работы по формированию позиции требуют от нас анализа позиций.Не следует, однако забывать, что консультация с широким активом представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что сложившаяся структура организации позволяет оценить значение новых предложений.",
		price: 2700,
		portion: 500,
	},
];

// const empty = [];
// const resultPromise = new Promise((resolve, reject) => {
// 	setTimeout(() => {
// 		resolve(productsInfo);
// 	}, 500);
// });

// export default resultPromise;

export default productsInfo;
